import React, { Component } from 'react';
import styles from './index.less';
import 'antd/dist/antd.css';


class UserAgreement extends Component{

    constructor(props) {
        super(props);
        this.state = {

        }
    }

    render(){

        return(
            <React.Fragment>
                <div style={{height:'10px',backgroundColor:':transparent'}}></div>
                <div className={styles.agreementBox}>
                    <p className={styles.aTitle}>智赛棋牌软件许可及服务协议</p>                    
                    <div style={{width:'94%', height:'2px', marginLeft:'3%', backgroundColor:'white', marginBottom:'5px'}}></div>
        <p>尊敬的智赛棋牌用户您好：</p>
        <p><strong>欢迎您加入智赛棋牌，为使用智赛棋牌游戏软件（以下简称“本软件”）及服务，您应当阅读并遵守《智赛棋牌游戏软件许可及服务协议》（以下简称“本协议”），以及<a href="http://www.qq.com/contract.shtml" target="_blank">《智赛棋牌服务协议》</a>、<a href="http://zc.qq.com/chs/agreement1_chs.html" target="_blank">《智赛棋牌号码规则》</a>和<a href="http://weixin.qq.com/cgi-bin/readtemplate?lang=zh_CN&amp;t=weixin_agreement&amp;s=default" target="_blank">《智赛棋牌微信软件许可及服务协议》</a>。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以黑体加粗形式提示您注意。</strong></p>
        <p><strong>除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本软件及相关服务。您的下载、安装、使用、登录等行为即视为您已阅读并同意上述协议的约束。</strong></p>
        <p><strong>如果您未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。</strong></p>


        <h3>一、【协议的范围】</h3>
        <h4>1.1 协议适用主体范围</h4>
        <p>本协议是您与智赛棋牌之间关于您下载、安装、使用、复制本软件，以及使用智赛棋牌相关服务所订立的协议。</p>
        <h4>1.2 协议关系及冲突条款</h4>
        <p>本协议被视为<a href="http://www.qq.com/contract.shtml" target="_blank">《智赛棋牌服务协议》</a>、<a href="http://zc.qq.com/chs/agreement1_chs.html" target="_blank">《智赛棋牌号码规则》</a>和<a href="http://weixin.qq.com/cgi-bin/readtemplate?lang=zh_CN&amp;t=weixin_agreement&amp;s=default" target="_blank">《智赛棋牌微信软件许可及服务协议》</a>的补充协议，是其不可分割的组成部分，与其构成统一整体。本协议与上述内容存在冲突的，以本协议为准。 </p>
        <p>本协议内容同时包括智赛棋牌可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。</p>


        <h3>二、【关于本服务】</h3>
        <h4>2.1 本服务的内容</h4>
        <p>2.1.1 本服务是指是指智赛棋牌向用户提供的安装在终端设备上的具有游戏下载及使用、道具售卖、用户互动等功能的软件许可及服务（以下简称“本服务”），软件名为“智赛棋牌游戏”或“智赛棋牌游戏大厅”。</p>
        <p><strong>2.1.2 本软件中的游戏既包括智赛棋牌游戏（智赛棋牌游戏指智赛棋牌自研的游戏或智赛棋牌独家代理的游戏），也包括开发者在智赛棋牌开放平台上传接入的游戏（以下简称“非智赛棋牌游戏”）。如您通过本软件下载或使用智赛棋牌游戏，您还应遵守《智赛棋牌游戏使用许可及服务协议》；如您通过本软件下载或使用非智赛棋牌游戏，您应当遵守非智赛棋牌游戏的开发者制定的协议，如您就非智赛棋牌运营的游戏有任何的诉求，您应当按照开发者在非智赛棋牌游戏中公布的联系方式联系开发者，或者进入<a href="http://open.qq.com/" target="_blank">智赛棋牌开放平台</a>按照<a href="http://wiki.open.qq.com/wiki/%E8%85%BE%E8%AE%AF%E5%BC%80%E6%94%BE%E5%B9%B3%E5%8F%B0%E4%BE%B5%E6%9D%83%E6%8A%95%E8%AF%89%E6%8C%87%E5%BC%95" target="_blank">“智赛棋牌开放平台侵权投诉指引”</a>通知智赛棋牌及开发者。</strong></p>
        <h4>2.2 本服务的形式</h4>
        <p>2.2.1 您使用本服务需要下载智赛棋牌游戏软件，对于这些软件，智赛棋牌给予您一项个人的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些软件及服务。</p>
        <p>2.2.2 本服务中智赛棋牌游戏软件提供包括但不限于Windows、Android、iOS等多个应用版本，用户必须选择与所安装终端设备相匹配的软件版本。</p>
        <h4>2.3本服务许可的范围</h4>
        <p>2.3.1智赛棋牌给予您一项个人的、不可转让及非排他性的许可，以使用本软件。您可以为非商业目的在单一终端设备上安装、使用、显示、运行本软件。 </p>
        <p>2.3.2您可以为使用本软件及服务的目的用计算机可读形式制作本软件的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息。</p>
        <p>2.3.3本条及本协议其他条款未明示授权的其他一切权利仍由智赛棋牌保留，您在行使这些权利时须另外取得智赛棋牌的书面许可。智赛棋牌如果未行使前述任何权利，并不构成对该权利的放弃。</p>


        <h3>三、【软件的获取】</h3>
        <p>3.1 您可以直接从智赛棋牌获取本软件，也可以从得到智赛棋牌授权的第三方获取。</p>
        <p><strong>3.2 如果您从未经智赛棋牌授权的第三方获取本软件或与本软件名称相同的安装程序，智赛棋牌无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。</strong></p>

        <h3>四、【软件的安装与卸载】</h3>
        <p><strong>4.1 智赛棋牌可能为不同的终端设备开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装，且您不得将本软件安装在未经智赛棋牌明示许可的其他终端设备上。由于您未正确安装合适的软件版本所带来的风险及损失，智赛棋牌不承担任何责任。</strong></p>
        <p>4.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。</p>
        <p>4.3 为提供更加优质、安全的服务，在本软件安装时智赛棋牌可能推荐您安装其他软件，您可以选择安装或不安装。</p>
        <p>4.4 如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助智赛棋牌改进产品服务，请告知卸载的原因。</p>

        <h3>五、【软件的更新】</h3>
        <p>5.1 为了增进用户体验、完善服务内容，智赛棋牌将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。</p>
        <p>5.2 为了改善用户体验，并保证服务的安全性和功能的一致性，智赛棋牌有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。</p>
        <p>5.3 本软件新版本发布后，旧版本的软件可能无法使用。智赛棋牌不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。</p>

        <h3>六、【用户个人信息保护】</h3>
        <p>6.1 保护用户个人信息是智赛棋牌的一项基本原则，智赛棋牌将会采取合理的措施保护用户的个人信息。智赛棋牌对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。</p>
        <p>6.2 智赛棋牌将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
        <p>6.3 您在使用本服务的过程中，可能需要使用一些必要的信息，例如：为了提供更优质的终端资源管理服务，需要您提供、展示移动终端设备型号或名称以完成设备对接、适配等；为了更好的提升用户互动体验以及提供应用推荐服务等，可能需要提供您所在的地理位置以实现产品功能。为了向您提供与好友互动正在玩儿的应用等服务，可能会获取您终端设备上部分应用程序的使用信息并可能会向您的好友展示，如您无需使用该服务的，您可自行关闭。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您不提供或提供的信息不完整，则无法使用本服务或在使用过程中受到限制。</p>
        <p>6.4 未经您的同意，智赛棋牌不会向智赛棋牌以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。</p>
        <p>6.5 智赛棋牌非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用智赛棋牌的服务前，应事先取得您家长或法定监护人的书面同意。</p>
        <p><strong>6.6 如果您通过本软件下载使用非智赛棋牌运营的游戏，您可能在使用该游戏的过程中会向该游戏的开发者披露您的个人信息，智赛棋牌提醒您在披露您的个人信息时谨慎决定。</strong></p>

        <h3>七、【主权利义务条款】</h3>
        <h4>7.1账号使用规范</h4>
        <p>7.1.1 智赛棋牌游戏的账户即您的智赛棋牌帐户或您的微信账号。应使用您拥有合法使用权的智赛棋牌号码或微信账户，并遵守《智赛棋牌号码规则》、《智赛棋牌微信软件许可及服务协议》及相关协议、规则等的约束。 同时，您承担以前述全部智赛棋牌号码或微信账号为标识进行的全部行为的法律责任。 </p>
        <p>7.1.2您应当做好账号和密码的保密措施。 因您保密措施不当或您的其他行为，致使上述口令、密码等丢失或泄漏所引起的一切损失和后果，均由您自行承担。 当在您怀疑他人在使用您的帐号时，您应立即通知智赛棋牌公司。</p>
        <h4>7.2用户注意事项</h4>
        <p>7.2.1 您理解并同意：为了向您提供有效的服务，您在此许可智赛棋牌利用您电脑及移动通讯终端的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。</p>
        <p>7.2.2 您在使用本软件某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为你接受相关单独协议。</p>
        <p><strong>7.2.3 用户在使用本软件及服务时，须自行承担如下包括但不限于智赛棋牌不可掌控的风险内容：</strong></p>
        <p>　<strong>7.2.3.1 由于不可抗拒因素引起的个人信息丢失、泄漏等风险；</strong></p>
        <p>　<strong>7.2.3.2 用户在使用本软件访问第三方网站或应用（如非智赛棋牌游戏）时遇到内容质量及安全问题等，均由用户自行承担。</strong></p>
        <p>　<strong>7.2.3.3 由于网络信号不稳定、网络带宽小等原因，所引起的智赛棋牌游戏同步登录失败、资料同步不完整、页面打开速度慢等风险；</strong></p>
        <p>　<strong>7.2.3.4 用户必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；</strong></p>
        <h4>7.3第三方产品和服务</h4>
        <p>7.3.1 您在使用本软件第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。智赛棋牌和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。</p>
        <p><strong>7.3.2 因用户使用本软件或要求智赛棋牌提供特定服务时，本软件可能会调用第三方系统或通过第三方支持用户的使用或访问（如非智赛棋牌游戏等），使用或访问的结果由该第三方提供，智赛棋牌不保证通过第三方系统提供的服务及内容或支持实现的结果的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与智赛棋牌无关，智赛棋牌不承担任何责任。智赛棋牌不对任何非智赛棋牌游戏的合法性、安全性、适用性及稳定性等作出保证，亦不对非智赛棋牌游戏承担任何责任。</strong></p>

        <h3>八、【用户行为规范】</h3>
        <h4>8.1 信息内容规范</h4>
        <p>8.1.1 您可使用本软件及服务发表属于您原创或您有权发表的观点看法、数据、文字、信息、用户名、图片、照片、个人信息、音频、视频文件、链接等信息内容。您必须保证，您拥有你所上传信息内容的著作权或已获得合法授权，您使用本软件及服务的任何行为未侵犯任何第三方之合法权益。</p>
        <p>8.1.2 您在使用本服务时不得利用本服务从事以下行为，包括但不限于：</p>
        <p>（1）发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽、暴力的内容；</p>
        <p>（2）发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；</p>
        <p>（3）虚构事实、隐瞒真相以误导、欺骗他人；</p>
        <p>（4）发表、传送、传播广告信息及垃圾信息；</p>
        <p>（5）其他违反法律法规、政策及公序良俗、社会公德或侵犯第三方合法权益内容的信息。</p>
        <h4>8.2 软件使用规范</h4>
        <p>除非法律允许或智赛棋牌书面许可，您使用本软件过程中不得从事下列行为：</p>
        <p>（1）删除本软件及其副本上关于著作权的信息；</p>
        <p>（2）对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；</p>
        <p>（3）对智赛棋牌拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</p>
        <p>（4）对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非智赛棋牌经授权的第三方工具/服务接入本软件和相关系统；</p>
        <p>（5）通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p>
        <p>（6）通过非智赛棋牌开发、授权的第三方软件、插件、外挂、系统，登录或使用智赛棋牌软件及服务，或制作、发布、传播上述工具；</p>
        <p>（7）自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；</p>
        <p>（8）其他未经智赛棋牌明示授权的行为；</p>
        <h4>8.3你理解并同意，基于用户体验、运营安全、规则要求及健康发展等综合因素，智赛棋牌有权选择提供服务的对象，有权决定功能设置，有权决定功能开放对象和范围。针对以下情形，有权视具体情况中止或终止提供本服务，包括但不限于：</h4>
        <p>（1）违反法律法规或本协议规定的；</p>
        <p>（2）影响服务体验的；</p>
        <p>（3）存在安全隐患的；</p>
        <p>（4）不符合智赛棋牌其他管理要求的。</p>
        <h4>8.4 对自己行为负责</h4>
        <p>您充分了解并同意，您必须为自己使用本服务及注册帐号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。智赛棋牌无法且不会对因前述风险而导致的任何损失或损害承担责任。</p>
        <h4>8.5 违约处理</h4>
        <p>如果智赛棋牌发现或收到他人举报或用户投诉您违反前述约定或本协议其他约定的，智赛棋牌有权进行独立判断并采取技术手段予以删除、屏蔽或断开相关的信息链接。同时，智赛棋牌有权视您的行为性质，采取包括但不限于暂停或终止本服务、追究法律责任等措施。 您理解并同意，智赛棋牌有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；智赛棋牌因此遭受损失的，您也应当一并赔偿。</p>

        <h3>九、【知识产权声明】</h3>
        <p>9.1 智赛棋牌是本软件的知识产权权利人。本软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，智赛棋牌享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。</p>
        <p>9.2 未经智赛棋牌或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</p>

        <h3>十、【终端安全责任】</h3>
        <p>10.1 您理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响（包括但不限于用户原因、网络服务质量、社会环境等）；也可能会受各种安全问题的侵扰（包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据的安全，继而影响本软件的正常使用等）。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。</p>
        <p>10.2 您不得制作、发布、使用、传播用于窃取智赛棋牌号码、微信账户及他人个人信息、财产的恶意程序。</p>
        <p>10.3 维护软件安全与正常使用是智赛棋牌和您的共同责任，智赛棋牌将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意智赛棋牌不能就此提供任何保证。</p>
        <p>10.4 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意智赛棋牌有关防范诈骗犯罪的提示。</p>

        <h3>十一、【第三方软件或技术】</h3>
        <p>11.1 本软件可能会使用第三方软件或技术（包括本软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。</p>
        <p>11.2 本软件如果使用了第三方的软件或技术，智赛棋牌将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包等形式进行展示，它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议或其他文件，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。<strong>如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求智赛棋牌给予协助，您应当自行承担法律责任。</strong></p>
        <p><strong>11.3 如因本软件使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，智赛棋牌不承担任何责任。智赛棋牌不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。</strong></p>

        <h3>十二、【关于免责】</h3>
        <p><strong>12.1 您理解并同意：鉴于网络服务的特殊性，智赛棋牌有权在无需通知您的情况下根据智赛棋牌游戏的整体运营情况或相关运营规范、规则等，可以随时变更、中止或终止部分或全部的服务，若由此给您造成损失的，您同意放弃追究智赛棋牌的责任。</strong></p>
        <p><strong>12.2 您理解并同意：为了向您提供更完善的服务，智赛棋牌有权定期或不定期地对提供本服务的平台或相关设备进行检修、维护、升级等，此类情况可能会造成相关服务在合理时间内中断或暂停的，若由此给您造成损失的，您同意放弃追究智赛棋牌的责任。</strong></p>
        <p><strong>12.3 您理解并同意：智赛棋牌的服务是按照现有技术和条件所能达到的现状提供的。智赛棋牌会尽最大努力向您提供服务，确保服务的连贯性和安全性；但智赛棋牌不能保证其所提供的服务毫无瑕疵，也无法随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。所以您也同意：即使智赛棋牌提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平所无法避免的，其将不被视为智赛棋牌违约，同时，由此给您造成的数据或信息丢失等损失的，您同意放弃追究智赛棋牌的责任。</strong></p>
        <p><strong>12.4 您理解并同意：在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，智赛棋牌将努力在第一时间与相关单位配合，及时进行修复，若由此给您造成损失的，您同意放弃追究智赛棋牌的责任。</strong></p>
        <p><strong>12.5 您理解并同意：若由于以下情形导致服务中断或受阻，给您造成损失的，您同意放弃追究智赛棋牌的责任：</strong></p>
        <p><strong>（1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</strong></p>
        <p><strong>（2）您或智赛棋牌的电脑软件、系统、硬件和通信线路出现故障；</strong></p>
        <p><strong>（3）您操作不当；</strong></p>
        <p><strong>（4）您通过非智赛棋牌授权的方式使用本服务；</strong></p>
        <p><strong>（5）其他智赛棋牌无法控制或合理预见的情形。 </strong></p>

        <h3>十三、【服务的中止或终止】</h3>
        <p>13.1 如您书面通知智赛棋牌不接受本协议或对其的修改，智赛棋牌有权随时中止或终止向您提供全部或部分本服务。</p>
        <p>13.2 因不可抗力因素导致您无法继续使用本服务或智赛棋牌无法提供本服务的，任何一方均有权随时终止协议。</p>
        <p>13.3 本协议约定的其他中止或终止条件发生或实现的，智赛棋牌有权随时中止或终止向您提供全部或部分本服务。</p>
        <p>13.4 如果一方及其债权人或任何其他合法方申请清算、破产、重组、和解或解除或一方资金无法维持公司正常运作；或一方无法赔偿任何应尽债务；或一方的债权人接管一方的经营，则相对方可终止本协议。 </p>
        <p>13.5 由于您违反本协议约定，智赛棋牌依约终止向您提供本服务后，如您后续再直接或间接，或以他人名义注册使用本服务的，智赛棋牌有权直接单方面暂停或终止提供本服务。</p>
        <p>13.6 如本协议或本服务因为任何原因终止的，对于您的帐号中的全部数据或您因使用本服务而存储在智赛棋牌服务器中的数据等任何信息，智赛棋牌可将该等信息保留或删除，包括服务终止前您尚未完成的任何数据。 </p>

        <h3>十四、【关于通知】</h3>
        <p>14.1 智赛棋牌可能会以网页公告、网页提示、电子邮箱、手机短信、智赛棋牌、常规的信件传送、您注册的本服务帐户的管理系统内发送站内信等方式中的一种或多种，向您送达关于本服务的各种规则、通知、提示等信息，该等信息一经智赛棋牌采取前述任何一种方式公布或发送，即视为送达，对您产生约束力。若您不接受的，请您书面通知智赛棋牌，否则视为您已经接受、同意。</p>
        <p>14.2 若您有事项需要通知智赛棋牌的，应当按照本服务对外正式公布的联系方式书面通知智赛棋牌。</p>

        <h3>十五、【其他】</h3>
        <p>15.1 <strong>您下载、安装、使用本软件即视为您已阅读并同意受本协议的约束。</strong>智赛棋牌有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。</p>
        <p><strong>15.2 本协议签订地为中华人民共和国广东省深圳市南山区。</strong></p>
        <p><strong>15.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</strong></p>
        <p><strong>15.4 若您和智赛棋牌之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</strong></p>
        <p>15.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
        <p>15.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。（正文完）</p>

        <p class="author">智赛棋牌公司</p>
                </div>
            </React.Fragment> 
                    
        )
    }
}

export default UserAgreement;